const titles = [
  '我感到情绪沮丧，郁闷',
  '我感到清晨心情很好', 	
  '我要哭或想哭',
  '我夜间睡眠不好',
  '我吃饭像平时一样多',
  '我的性功能正常',
  '我感到体重减轻',
  '我为便秘烦恼',
  '我的心跳比平时快',
  '我无故感到疲劳',
  '我的头脑像往常一样清楚',
  '我做事情像平时一样不觉得困难',
  '我坐卧不安，难以保持平静',
  '我对未来抱有希望',
  '我比平时更容易激怒',
  '我做决定很容易',
  '我感到自己是有用的和不可缺少的人',
  '我的生活很有意义',
  '假若我死了别人会过的更好',
  '我仍旧喜爱自己平时喜爱的东西'
]

export default titles.map(title => {
  return {
    title: `${title}？`,
    answers: [{
      text: '没有',
      score: 1
    }, {
      text: '有时',
      score: 2
    }, {
      text: '经常',
      score: 3
    }, {
      text: '持续',
      score: 4
    }]
  }
})
